<template>
    <div>
        <textarea v-model="message"></textarea>
        <pre>{{ message }}</pre>
    </div>
</template>
<!--(background)
    ＊컴포넌트란?
    
    웹 개발에서 사용가능한 독립적인 모듈로, UI의 구성요소를 나타낸다.
    컴포넌트는 HTML, CSS, JavaScript의 코드와 스타일을 묶어 하나의 독립적인 단위로 구성된다.
    즉, 웹 페이지나 애플리케이션의 다양한 부분을 구성하는 작은 단위나 조각으로 생각할 수 있다.
    예시로 앞서 작성한 로그인 및 회원가입 폼이나 메뉴 바, 알림 팝업 등은 
    각각 독립된 컴포넌트로 구현할 수 있다.

    독립적으로 구현이 가능하므로, 컴포넌트는 코드의 유지·보수와 재사용에 유리한 장점이 있다.
    (자바에서 도메인 분리, 마이크로 프론트엔드에서 메뉴나 항목별로 서비스를 관리하는 것처럼
    유지보수를 쉽게 만드는 것과 같다고 생각하면 될 것 같다.)
    한 번 작성한 컴포넌트는 필요한 곳에 재사용할 수 있고, 필요에 따라 수정해서 사용할 수 있다.
    컴포넌트 간의 결합도도 낮출 수 있으므로, 효율적인 개발을 가능하게 만들어준다.
    아래와 같은 형태로 웹 페이지가 형성되는 것으로 이해하면 된다.
                +---------------------------------------+
                |                                       |
                |                  App                  |
                |                                       |
                +-------------------+-------------------+
                                    |
                +-------------------|-------------------+
                |                   |                   |
        +-----------------+  +-----------------+  +-----------------+
        |   (Component)   |  |   (Component)   |  |   (Component)   |
        |                 |  |                 |  |                 |
        |    HTML         |  |    HTML         |  |    HTML         |
        |                 |  |                 |  |                 |
        |    CSS          |  |    CSS          |  |    CSS          |
        |                 |  |                 |  |                 |
        |    JavaScript   |  |    JavaScript   |  |    JavaScript   |
        |                 |  |                 |  |                 |
        +-----------------+  +-----------------+  +-----------------+
-->
<!--
    template로 컴포넌트의 템플릿 부분을 정의하고, 
    안에 HTML 코드를 작성하여 원하는 화면구조를 형성한다.
    
    div는 HTML에서 블록(웹 문서의 구조를 형성하는 요소)을 생성한다.
    일반적으로 사용되는 블록은 div, p, h1~h6, ul, ol li, section 등이 있다.
    이러한 블록은 웹페이지의 구조를 형성하고 콘텐츠 그룹화에 사용된다.

    textarea는 텍스트를 다중의 줄로 입력할 수 있는 HTML 요소다.
    v-model 디렉티브를 사용해 Vue의 데이터와 양방향 바인딩이 된다.
    (디렉티브가 뭔지 모르지만 양방향으로 실시간 데이터 업데이트가 된다고 이해함.)
    message 데이터 값이 변경되면 <textarea>의 내용이 업데이트 되고,
    반대로 <textarea>에 입력한 값이 message 데이터에 반영된다.
-->

<script>
export default {
    data () {
        return {
            message: '초기값',
        }
    }    
}

</script>
<!--
    <script> 태그는 JavaScript 코드를 작성하는 부분으로, 
    Vue 컴포넌트의 JavaScript 로직을 입력한다.
    
    export default는 현재 파일에서 Vue 컴포넌트를 내보내는 역할을 한다.
    다른 파일에서 이 컴포넌트를 import하여 사용가능하게 만들어주는 것이다.

    data()는 Vue 컴포넌트의 데이터 옵션을 정의해준다.
    return으로 데이터 객체를 반환하며, message 데이터 속성을 '초기값'으로 설정했다.
-->

<style>
    
</style>